[
    {
        "id": 1,
        "studentId": 4,
        "studentName": "Ahmed Hany",
        "companyName": "QNB",
        "mainSupervisor": "Hossam El-Din",
        "startDate": "2025-08-23",
        "endDate": "2025-09-21",
        "title": "QNB Internship Experience",
        "introduction": "This report discusses the key learnings and activities during my internship at QNB.",
        "body": "During the internship at QNB, I was involved in various projects and tasks under the guidance of Hossam El-Din. The experience provided practical insights and significantly improved my skills.",
        "status": "pending",
        "major": "MET",
        "evaluation": {
            "recommend": true,
            "comment": "Great learning environment with supportive mentors. The banking projects were challenging and educational. The work-life balance was excellent, and the team was very welcoming."
        },
        "adminComment": "",
        "appeal": {
            "message": "",
            "status": "none"
        }
    },
    {
        "id": 2,
        "studentId": 9,
        "studentName": "Youssef Adel",
        "companyName": "Nestle",
        "mainSupervisor": "Nourhan Yasser",
        "startDate": "2025-01-08",
        "endDate": "2025-02-06",
        "title": "Nestle Internship Experience",
        "introduction": "This report discusses the key learnings and activities during my internship at Nestle.",
        "body": "During the internship at Nestle, I was involved in various projects and tasks under the guidance of Nourhan Yasser. The experience provided practical insights and significantly improved my skills.",
        "status": "flagged",
        "major": "IET",
        "evaluation": {
            "recommend": false,
            "comment": "While the company is prestigious, the internship lacked structure and clear objectives. Limited hands-on experience and minimal interaction with the main team. The learning curve was not as steep as expected."
        },
        "adminComment": "The report lacks specific details about the projects and learning outcomes. Please provide more concrete examples of your work and achievements.",
        "appeal": {
            "message": "I would like to appeal this decision as I have documented evidence of my project contributions that I can provide.",
            "status": "pending"
        }
    },
    {
        "id": 3,
        "studentId": 14,
        "studentName": "Omar Atef",
        "companyName": "Microsoft",
        "mainSupervisor": "Khaled Samir",
        "startDate": "2025-07-22",
        "endDate": "2025-09-19",
        "title": "Microsoft Internship Experience",
        "introduction": "This report discusses the key learnings and activities during my internship at Microsoft.",
        "body": "During the internship at Microsoft, I was involved in various projects and tasks under the guidance of Khaled Samir. The experience provided practical insights and significantly improved my skills.",
        "status": "rejected",
        "major": "Mechatronics",
        "evaluation": {
            "recommend": true,
            "comment": "Outstanding internship program with cutting-edge technology exposure. The mentorship was exceptional, and I got to work on real projects that made an impact. The company culture is innovative and inclusive."
        }
    },
    {
        "id": 4,
        "studentId": 7,
        "studentName": "Moahmed Khaled",
        "companyName": "Valeo",
        "mainSupervisor": "Sara Hany",
        "startDate": "2025-01-14",
        "endDate": "2025-02-12",
        "title": "Valeo Internship Experience",
        "introduction": "This report discusses the key learnings and activities during my internship at Valeo.",
        "body": "During the internship at Valeo, I was involved in various projects and tasks under the guidance of Sara Hany. The experience provided practical insights and significantly improved my skills.",
        "status": "accepted",
        "major": "IET",
        "evaluation": {
            "recommend": true,
            "comment": "Excellent opportunity to work on automotive software systems. The team was very supportive, and I learned a lot about embedded systems and automotive technology. Great work environment and professional development opportunities."
        }
    },
    {
        "id": 5,
        "studentId": 6,
        "studentName": "Lamine Yamal",
        "companyName": "Etisalat",
        "mainSupervisor": "Mostafa Nour",
        "startDate": "2025-06-11",
        "endDate": "2025-08-09",
        "title": "Etisalat Internship Experience",
        "introduction": "This report discusses the key learnings and activities during my internship at Etisalat.",
        "body": "During the internship at Etisalat, I was involved in various projects and tasks under the guidance of Mostafa Nour. The experience provided practical insights and significantly improved my skills.",
        "status": "pending",
        "major": "BI",
        "evaluation": {
            "recommend": true,
            "comment": "Great exposure to telecommunications technology and network infrastructure. The internship provided valuable insights into the industry. The team was knowledgeable and willing to share their expertise."
        }
    },
    {
        "id": 6,
        "studentId": 5,
        "studentName": "Marwan Yasser",
        "companyName": "IBM",
        "mainSupervisor": "Omar Mahmoud",
        "startDate": "2025-06-08",
        "endDate": "2025-08-06",
        "title": "IBM Internship Experience",
        "introduction": "This report discusses the key learnings and activities during my internship at IBM.",
        "body": "During the internship at IBM, I was involved in various projects and tasks under the guidance of Omar Mahmoud. The experience provided practical insights and significantly improved my skills.",
        "status": "flagged",
        "major": "MET",
        "evaluation": {
            "recommend": false,
            "comment": "The internship was more theoretical than practical. Limited access to real projects and the work environment was quite rigid. The learning opportunities were not as comprehensive as advertised."
        }
    }
]